{"models":[{"qubership-name":"qubership-profiler-agent","category":"n/a","subcategory":"n/a","alternatives":["n/a"],"reasons":"The provided content describes a plugin for Tomcat HTTP ESC (likely referring to the 'javax.servlet.*' packages) for versions <= 9.x, applicable to Tomcat, WildFly, and Spring Boot. This appears to be a specific instrumentation tool for older versions of Tomcat and related technologies, rather than a standalone CNCF project or framework. The CNCF landscape primarily focuses on cloud-native technologies like orchestration, service meshes, monitoring, etc., and this plugin does not clearly fit into any of those categories. Since it is a niche tool for legacy server instrumentation, there are no direct alternatives in the CNCF landscape."},{"qubership-name":"qubership-core-lib-go-dbaas-mongo-client","category":"Database","subcategory":"NewSQL Databases","alternatives":["Vitess","TiDB","CockroachDB"],"reasons":"The provided file describes a MongoDB client library for Go, which is used to interact with MongoDB databases. This falls under the Database category in the CNCF landscape. Specifically, it is a client library for a NewSQL database (MongoDB), which is why it is categorized under NewSQL Databases. Alternatives like Vitess, TiDB, and CockroachDB are also NewSQL databases that provide similar functionalities for interacting with distributed databases."},{"qubership-name":"qubership-integration-catalog-library","category":"App Definition and Development","subcategory":"Integration and Delivery","alternatives":["Backstage","Crossplane","KubeVela"],"reasons":"The provided content describes 'Catalog Library' as part of a global integration solution, which appears to focus on integrating and managing microservices between runtime and design-time catalogs. This aligns with the 'App Definition and Development' category in the CNCF landscape, specifically under 'Integration and Delivery' subcategory, as it involves tools that help in integrating and delivering applications. Alternatives like Backstage, Crossplane, and KubeVela are listed as they provide similar capabilities in service cataloging, integration, and delivery within cloud-native environments."},{"qubership-name":"qubership-graylog-obfuscation-plugin","category":"App Definition and Development","subcategory":"Continuous Integration & Delivery","alternatives":["Tekton","Argo CD","Flux"],"reasons":"The provided file describes a plugin for automatic analysis and obfuscation of input log messages, which is likely used in a CI/CD pipeline. The mention of SuperLinter and GitHub workflows suggests it's part of a development and automation process. The category 'App Definition and Development' with subcategory 'Continuous Integration & Delivery' fits best as it involves tools that help in automating the software development lifecycle. Alternatives like Tekton, Argo CD, and Flux are popular CI/CD tools in the CNCF landscape that also focus on automation and integration within development workflows."},{"qubership-name":"qubership-core-lib-go-bg-state-monitor","category":"App Definition and Development","subcategory":"Application Configuration","alternatives":["Consul","etcd","Zookeeper"],"reasons":"The provided file describes a Go library for monitoring blue-green states, which interacts with Consul for state management. This fits under 'App Definition and Development' as it's a tool for managing application state and configuration. The library's functionality is similar to other service discovery and configuration management tools in the CNCF landscape, such as Consul, etcd, and Zookeeper, which are used for maintaining and monitoring application states in distributed systems."},{"qubership-name":"qubership-apihub-compatibility-suites","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Kong","Apigee","Tyk"],"reasons":"The provided content describes a tool or framework focused on API compatibility and changes classification, specifically mentioning OpenAPI and GraphQL. This aligns with the 'API Gateway' subcategory under 'App Definition and Development' in the CNCF landscape. The tool seems to be used for testing and managing API changes, which is a common use case for API gateways. Alternatives like Kong, Apigee, and Tyk are listed as they are prominent CNCF-listed solutions in the API gateway space that also handle API versioning, testing, and compatibility."},{"qubership-name":"qubership-maas","category":"Application Definition and Development","subcategory":"Messaging and Eventing","alternatives":["NATS","RabbitMQ","Apache Kafka","Pulsar"],"reasons":"The provided file describes Maas (Messaging as a Service), which is a solution for managing messaging entities like queues, topics, and exchanges on RabbitMQ and Kafka brokers. It fits into the 'Messaging and Eventing' subcategory of the 'Application Definition and Development' category in the CNCF landscape because it provides a declarative way to manage messaging infrastructure, similar to other messaging solutions like NATS, RabbitMQ, Apache Kafka, and Pulsar. Maas offers features like entity management, security roles, and monitoring, which are common in messaging systems. The alternatives listed are other CNCF projects that also provide messaging and eventing capabilities."},{"qubership-name":"qubership-opensearch-curator","category":"Management and Governance","subcategory":"Automation and Configuration","alternatives":["Kubernetes CronJob","Argo Workflows","Tekton Pipelines"],"reasons":"The Elasticsearch Indices Cleaner is a tool designed to manage and clean up Elasticsearch indices based on predefined patterns and schedules. It fits into the 'Management and Governance' category because it deals with resource management and automation. The 'Automation and Configuration' subcategory is appropriate as it involves scheduled tasks and configuration management. Alternatives like Kubernetes CronJob, Argo Workflows, and Tekton Pipelines are listed because they also handle scheduled tasks and workflow automation in cloud-native environments."},{"qubership-name":"qubership-jaeger","category":"Observability and Analysis","subcategory":"Monitoring","alternatives":["Prometheus","Kube-state-metrics","Liveness and Readiness Probes (built-in Kubernetes)"],"reasons":"The provided file describes a readiness probe used for executing checks and providing custom readiness probes for Jaeger. This functionality falls under the Observability and Analysis category, specifically in Monitoring, as it involves checking the health and readiness of services. Alternatives like Prometheus and Kube-state-metrics are mentioned as they are commonly used for monitoring in cloud-native environments. The built-in Kubernetes liveness and readiness probes are also alternatives as they serve a similar purpose of checking service health."},{"qubership-name":"qubership-renovate-config","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content is insufficient to determine the category or subcategory within the CNCF landscape. The text 'I# qubership-renovate-config' appears to be a fragment or a configuration reference, but it lacks meaningful context about the solution's purpose, functionality, or scope. Without additional details, it is impossible to classify it or suggest alternatives."},{"qubership-name":"qubership-nifi","category":"App Definition and Development","subcategory":"Workflow Orchestration","alternatives":["Apache NiFi","Argo Workflows","Tekton Pipelines"],"reasons":"qubership-nifi is a fork of Apache NiFi, which is a scalable and configurable dataflow platform. It falls under the Workflow Orchestration subcategory because it manages data flows between systems. The additional features like integration with Consul, automated configuration restore, and enhanced processors make it a more specialized tool within this category. Alternatives like Apache NiFi (the original project), Argo Workflows, and Tekton Pipelines are also workflow orchestration tools that handle data and task automation in cloud-native environments."},{"qubership-name":"qubership-mongodb-driver","category":"Database","subcategory":"n/a","alternatives":["MongoDB","PostgreSQL","MySQL","CockroachDB","TiDB"],"reasons":"The file mentions 'mongodb-driver' in the title, which suggests that the solution is related to MongoDB, a popular NoSQL database. MongoDB is widely used in cloud-native applications, and the CNCF landscape includes several database solutions that are commonly used in cloud-native environments. The alternatives listed are other well-known databases that are part of the CNCF ecosystem or are commonly used in cloud-native applications."},{"qubership-name":"qubership-dbaas-adapter-core","category":"Database","subcategory":"n/a","alternatives":["Vitess","TiKV","CockroachDB"],"reasons":"The description mentions 'Qubership DBaaS Adapter Core' as a base library for all Qubership DBaaS adapters, which suggests it is related to database management. Given that it is an adapter core, it likely facilitates interactions with databases in a cloud-native environment. Alternatives like Vitess, TiKV, and CockroachDB are also part of the CNCF landscape and are known for their cloud-native database capabilities."},{"qubership-name":"qubership-integration-sessions-management","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["KubeVela","Dapr","Backstage"],"reasons":"The provided description mentions that 'Sessions Management' is part of a global integration solution, specifically the 'kuberneteship-integration-platform', which manages sessions created during integration flows called 'chains' and stores them in OpenSearch. This suggests that the solution is focused on application development and integration within a cloud-native environment. The category 'App Definition and Development' fits well as it encompasses tools and frameworks that help in defining, building, and managing applications in cloud-native ecosystems. Subcategory 'Application Definition & Image Build' is chosen because the solution seems to involve defining application workflows (chains) and managing their runtime sessions. Alternatives like KubeVela, Dapr, and Backstage are listed as they provide similar capabilities in application definition, development, and integration within cloud-native environments."},{"qubership-name":"qubership-core-arquillian-cube-extension","category":"App Definition and Development","subcategory":"Testing","alternatives":["Testcontainers","Kubernetes-test","Kubetest"],"reasons":"The provided file describes a JUnit-5 extension for connecting to Kubernetes in integration tests. This fits into the 'Testing' subcategory under 'App Definition and Development' in the CNCF landscape. The solution facilitates integration testing with Kubernetes, similar to other testing tools like Testcontainers, Kubernetes-test, and Kubetest, which are also part of the CNCF ecosystem. The file details how to enable the extension, perform port forwarding, and manage tokens, which are common requirements in Kubernetes testing scenarios."},{"qubership-name":"qubership-maas-client-quarkus","category":"App Definition and Development","subcategory":"Streaming & Messaging","alternatives":["Apache Kafka","RabbitMQ","NATS"],"reasons":"The provided file describes a Quarkus extension for a Maas client, which includes support for Kafka and RabbitMQ. This suggests that the solution is related to messaging and streaming, which falls under the 'App Definition and Development' category in the CNCF landscape, specifically under 'Streaming & Messaging'. Alternatives like Apache Kafka, RabbitMQ, and NATS are also part of this category and provide similar messaging capabilities."},{"qubership-name":"qubership-core-lib-go-maas-client","category":"App Definition and Development","subcategory":"Streaming & Messaging","alternatives":["Apache Kafka","RabbitMQ","NATS","Pulsar"],"reasons":"The provided file describes a Go client for performing operations with Maas, specifically related to Kafka and RabbitMQ. The client is designed to interact with messaging systems, which falls under the 'Streaming & Messaging' subcategory of the 'App Definition and Development' category in the CNCF landscape. The alternatives listed are other popular messaging systems within the CNCF ecosystem that serve similar purposes."},{"qubership-name":"qubership-core-lib-go-dbaas-opensearch-client","category":"Database","subcategory":"Search Engine","alternatives":["Elasticsearch","Apache Solr","OpenSearch"],"reasons":"The provided file describes a Go client library for interacting with OpenSearch databases, which is a search engine solution. The library supports multi-tenancy and can work with both service and tenant databases. It provides functionality for creating and managing indices, aliases, and templates in OpenSearch. Given this functionality, it best fits under the 'Database' category and specifically under the 'Search Engine' subcategory in the CNCF landscape. Alternatives like Elasticsearch, Apache Solr, and OpenSearch are listed as they are similar search engine solutions within the CNCF ecosystem."},{"qubership-name":"qubership-tcp-duplicator","category":"Networking","subcategory":"Service Proxy","alternatives":["Envoy","Linkerd","HAProxy","NGINX"],"reasons":"The 'tcp-duplicator' is described as a TCP proxy that mirrors data to all configured servers, which aligns with the networking category in the CNCF landscape, specifically under service proxies. It handles TCP traffic without concern for higher-level protocols, similar to other service proxies like Envoy, Linkerd, HAProxy, and NGINX. These alternatives are also focused on managing and directing network traffic, making them suitable comparisons. The solution's primary function of duplicating TCP traffic to multiple servers is a common feature in service proxies, hence the categorization."},{"qubership-name":"qubership-log-generator","category":"Observability and Analysis","subcategory":"Logging","alternatives":["Fluentd","Loki","Elasticsearch","OpenSearch"],"reasons":"The QuberShip Log Generator is a tool designed to generate high load logs for performance testing and debugging purposes. It allows users to create logs based on predefined templates (Java, Go, JSON logs) and custom patterns, and it provides metrics related to log generation. This functionality aligns with the 'Logging' subcategory under 'Observability and Analysis' in the CNCF landscape. Alternatives like Fluentd, Loki, Elasticsearch, and OpenSearch are also focused on log management and analysis, making them suitable comparisons."},{"qubership-name":"pgskipper-monitoring-agent","category":"Monitoring","subcategory":"n/a","alternatives":["Prometheus","Thanos","VictoriaMetrics"],"reasons":"The name 'pgskipper-monitoring-agent' suggests that this is a monitoring agent, likely for PostgreSQL databases ('pg' prefix is commonly used for PostgreSQL-related tools). Since monitoring is a well-defined category in the CNCF landscape, and given the name, it's reasonable to place it there. Alternatives like Prometheus, Thanos, and VictoriaMetrics are also monitoring solutions within the CNCF ecosystem, though they are more general-purpose compared to what appears to be a PostgreSQL-specific tool."}]}