{"models":[{"qubership-name":"qubership-profiler-agent","category":"n/a","subcategory":"n/a","alternatives":["n/a"],"reasons":"The provided content describes a plugin for instrumenting HTTP context in Tomcat <= 9.x, WildFly <= 26.x, and Spring Boot <= 2.x. This appears to be a specific tool or plugin for monitoring or instrumentation within these application servers or frameworks. However, the CNCF landscape primarily focuses on cloud-native technologies such as container orchestration, service meshes, monitoring, logging, etc. This plugin does not clearly fit into any of the major CNCF categories (e.g., Orchestration & Management, Runtime, Networking, etc.). Therefore, it is difficult to categorize it within the CNCF landscape, and no direct alternatives from CNCF are apparent."},{"qubership-name":"qubership-core-lib-go-dbaas-mongo-client","category":"Database","subcategory":"Database Clients and Libraries","alternatives":["MongoDB Go Driver","mgo","go-mongo-driver"],"reasons":"The provided file describes a Go client library for interacting with MongoDB databases, specifically designed to work with multi-tenancy and service databases. It provides functionality for creating and managing database connections, handling SSL/TLS, and executing queries. This fits well under the 'Database' category in the CNCF landscape, specifically under 'Database Clients and Libraries'. Alternatives like the official 'MongoDB Go Driver', 'mgo', and 'go-mongo-driver' are similar solutions that provide MongoDB connectivity in Go."},{"qubership-name":"qubership-integration-catalog-library","category":"App Definition and Development","subcategory":"Integration & Delivery","alternatives":["Backstage","Crossplane","KubeVela"],"reasons":"The description mentions that 'Catalog Library' is part of a global integration solution, which involves transitioning between Runtime Catalog and Design Time Catalog microservices. This suggests it is related to application development and integration, fitting well under 'App Definition and Development' in the CNCF landscape. The subcategory 'Integration & Delivery' is chosen because the solution appears to facilitate integration between different components or services. Alternatives like Backstage, Crossplane, and KubeVela are listed as they are prominent CNCF projects in the integration and delivery space."},{"qubership-name":"qubership-graylog-obfuscation-plugin","category":"App Definition and Development","subcategory":"Continuous Integration & Delivery","alternatives":["Argo","Tekton","Flux"],"reasons":"The provided file describes a plugin for automatic analysis and obfuscation of input log messages, which seems to be related to development workflows, specifically in the area of CI/CD. The mention of SuperLinter and GitHub workflows further supports this categorization. The alternatives listed are other CI/CD tools in the CNCF landscape that facilitate similar automation and integration tasks."},{"qubership-name":"qubership-core-lib-go-bg-state-monitor","category":"App Definition and Development","subcategory":"Application Configuration","alternatives":["Consul","etcd","Zookeeper"],"reasons":"The provided content describes a Go library for monitoring blue-green states, which interacts with Consul for state management. This fits under 'App Definition and Development' as it's a tool for managing application state and configuration. The 'Application Configuration' subcategory is appropriate because the library is used to monitor and manage application state transitions (blue-green deployment states). Alternatives like Consul, etcd, and Zookeeper are listed as they are CNCF projects commonly used for similar configuration and state management purposes. The content does not provide enough detail to determine if it fits more specifically into other categories like 'Orchestration & Management' or 'Runtime'."},{"qubership-name":"qubership-apihub-compatibility-suites","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Kong","Apigee","Tyk"],"reasons":"The provided file describes a collection of important cases of API changes for classification purposes, specifically mentioning OpenAPI and GraphQL. This suggests the solution is related to API management and development. The CNCF category that best fits this description is 'App Definition and Development', with a subcategory of 'API Gateway' as it deals with API specifications and changes. Alternatives like Kong, Apigee, and Tyk are listed as they are prominent API gateway solutions within the CNCF landscape that handle API management and versioning."},{"qubership-name":"qubership-maas","category":"Application Definition and Development","subcategory":"Messaging and Eventing","alternatives":["NATS","RabbitMQ","Apache Kafka","Pulsar"],"reasons":"The description provided outlines Maas (Messaging as a Service), which is a solution designed to create and manage entities on RabbitMQ and Kafka brokers. It provides declarative configuration and REST API calls for managing these entities, which aligns with the messaging and eventing category in the CNCF landscape. Maas is intended to support Blue/Green application deployments and requires integration with a PostgreSQL database for data persistence. It also includes features like lazy topics, tenant topics, and instance designators for more selective instance choices. Given its focus on messaging systems like RabbitMQ and Kafka, it fits best under the 'Messaging and Eventing' subcategory. Alternatives like NATS, RabbitMQ, Apache Kafka, and Pulsar are also part of this category and provide similar functionalities."},{"qubership-name":"qubership-opensearch-curator","category":"Database","subcategory":"Database Management and Operations","alternatives":["Elasticsearch Curator","KubeDB","Strimzi"],"reasons":"The provided content describes a tool for managing Elasticsearch indices by deleting them based on predefined patterns. This functionality falls under database management and operations, specifically for Elasticsearch, which is a database technology. The alternatives listed are other tools within the CNCF landscape that provide similar functionality for managing databases or data streams. Elasticsearch Curator is a direct alternative as it also manages Elasticsearch indices. KubeDB provides database management capabilities for various databases, and Strimzi is focused on managing Kafka, which can be used for data streaming and management."},{"qubership-name":"qubership-jaeger","category":"Observability and Analysis","subcategory":"Monitoring","alternatives":["Prometheus","Liveness Probe (Kubernetes native)","kube-state-metrics"],"reasons":"The provided file describes a 'Readiness Probe' used for executing checks and providing custom readiness probes for Jaeger. This fits under the 'Observability and Analysis' category in the CNCF landscape, specifically under 'Monitoring' as it deals with health checks and readiness of services. Alternatives like Prometheus, Kubernetes native liveness probes, and kube-state-metrics are commonly used for similar purposes in cloud-native environments."},{"qubership-name":"qubership-renovate-config","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content is insufficient to determine the category or subcategory of the solution within the CNCF landscape. The content appears to be a base64 encoded string with a mention of 'qubership-renovate-config', but without further context or description, it is not possible to accurately classify it or suggest alternatives."},{"qubership-name":"qubership-nifi","category":"App Definition and Development","subcategory":"Workflow & Orchestration","alternatives":["Apache NiFi","Argo","Tekton","Kubeflow Pipelines"],"reasons":"The provided file describes 'qubership-nifi', which is a fork of Apache NiFi. Apache NiFi is a dataflow platform designed to automate the movement of data between systems. It fits into the 'Workflow & Orchestration' subcategory under 'App Definition and Development' in the CNCF landscape. This is because it handles data workflows and orchestration, similar to other tools like Argo, Tekton, and Kubeflow Pipelines, which are also designed for workflow automation and orchestration in cloud-native environments. The additional features mentioned, such as integration with Consul for configuration and logging, bulk DB operations, and JSON extraction, further reinforce its role in workflow and data orchestration."},{"qubership-name":"qubership-mongodb-driver","category":"Database","subcategory":"n/a","alternatives":["MongoDB","PostgreSQL","MySQL","Redis"],"reasons":"The file mentions 'mongodb-driver' in the initial part, which suggests that the solution is related to MongoDB, a NoSQL database. MongoDB is a popular database solution in the CNCF landscape, and other similar solutions include PostgreSQL, MySQL, and Redis, which are also widely used in cloud-native environments."},{"qubership-name":"qubership-dbaas-adapter-core","category":"Database","subcategory":"n/a","alternatives":["Vitess","TiKV","CockroachDB"],"reasons":"The description mentions 'Qubership DBaaS Adapter Core' as a base library for all Qubership DBaaS adapters, which suggests it is related to database management and operations, likely in a cloud-native context. This fits under the 'Database' category in the CNCF landscape. Alternatives like Vitess, TiKV, and CockroachDB are also cloud-native database solutions that provide similar functionalities for managing databases in scalable and distributed environments. The subcategory is not specified as the description does not provide enough detail to determine whether it is a SQL, NoSQL, or another specific type of database solution."},{"qubership-name":"qubership-integration-sessions-management","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["KubeVela","OpenShift","Backstage"],"reasons":"The description mentions that the solution is part of a global integration platform and manages sessions created during the execution of integration flows called 'chains'. It also stores sessions in OpenSearch. This suggests that the solution is focused on application development and integration, which aligns with the 'App Definition and Development' category in the CNCF landscape. The subcategory 'Application Definition & Image Build' is chosen because the solution seems to involve defining and managing application sessions and their data. Alternatives like KubeVela, OpenShift, and Backstage are suggested as they also provide platforms for application development, integration, and management within the CNCF ecosystem."},{"qubership-name":"qubership-core-arquillian-cube-extension","category":"App Definition and Development","subcategory":"Testing","alternatives":["Testcontainers","Kubernetes Test Framework (KTF)","Sonobuoy"],"reasons":"The provided content describes a JUnit-5 extension for connecting to Kubernetes in integration tests. This fits under the 'Testing' subcategory of 'App Definition and Development' in the CNCF landscape. The solution focuses on facilitating integration tests for Kubernetes environments, similar to other testing tools like Testcontainers, KTF, and Sonobuoy, which are also designed to support testing in cloud-native environments."},{"qubership-name":"qubership-maas-client-quarkus","category":"App Definition and Development","subcategory":"Streaming & Messaging","alternatives":["Apache Kafka","RabbitMQ","NATS"],"reasons":"The provided file describes a Quarkus extension for a Maas client, which includes integrations with Kafka and RabbitMQ for messaging. This fits well within the 'Streaming & Messaging' subcategory of the 'App Definition and Development' category in the CNCF landscape. Alternatives like Apache Kafka, RabbitMQ, and NATS are also part of this subcategory and provide similar messaging capabilities."},{"qubership-name":"qubership-core-lib-go-maas-client","category":"Messaging and Eventing","subcategory":"Message Brokers","alternatives":["Apache Kafka","RabbitMQ","NATS","Pulsar"],"reasons":"The provided file describes a Go client for performing operations with Maas, specifically focusing on Kafka and RabbitMQ integrations. The client is designed to interact with message brokers, which aligns with the 'Messaging and Eventing' category in the CNCF landscape. The subcategory 'Message Brokers' is chosen because the client directly interacts with Kafka and RabbitMQ, which are prominent message brokers. Alternatives listed are other well-known message brokers in the CNCF ecosystem that serve similar purposes."},{"qubership-name":"qubership-core-lib-go-dbaas-opensearch-client","category":"Database","subcategory":"Search and Indexing","alternatives":["Elasticsearch","Apache Solr","ZincSearch"],"reasons":"The provided file describes a Go client library for interacting with OpenSearch databases, specifically designed to work with multi-tenancy and service databases. It provides functionality for creating and managing indices, aliases, and templates in OpenSearch, with support for SSL/TLS. Given its focus on search and indexing functionalities within a cloud-native environment, it best fits under the 'Database' category with a subcategory of 'Search and Indexing' in the CNCF landscape. Alternatives like Elasticsearch, Apache Solr, and ZincSearch are listed as they are prominent open-source search and indexing solutions within the CNCF ecosystem that offer similar functionalities."},{"qubership-name":"qubership-tcp-duplicator","category":"Networking","subcategory":"Service Proxy","alternatives":["Envoy","Linkerd","HAProxy","NGINX"],"reasons":"The provided file describes 'tcp-duplicator', a TCP proxy that mirrors data to all configured servers. This functionality falls under the Networking category in the CNCF landscape, specifically within the Service Proxy subcategory, as it deals with network traffic management and duplication. Alternatives like Envoy, Linkerd, HAProxy, and NGINX are listed because they are well-known solutions in the CNCF landscape that also handle network proxying, load balancing, and traffic management, albeit with more features and broader protocol support."},{"qubership-name":"qubership-log-generator","category":"Observability and Analysis","subcategory":"Logging","alternatives":["Fluentd","Loki","Elasticsearch","Fluent Bit"],"reasons":"The QuberShip Log Generator is a tool designed to generate high load logs for performance testing and debugging logging services. It fits into the 'Logging' subcategory of the 'Observability and Analysis' category in the CNCF landscape because it is specifically focused on log generation and analysis. Alternatives like Fluentd, Loki, Elasticsearch, and Fluent Bit are also part of the CNCF landscape and are widely used for logging purposes, though they are more general-purpose compared to the specialized log generation focus of QuberShip Log Generator."},{"qubership-name":"pgskipper-monitoring-agent","category":"Monitoring","subcategory":"n/a","alternatives":["Prometheus","Thanos","VictoriaMetrics"],"reasons":"The filename 'pgskipper-monitoring-agent' suggests that this is a monitoring agent, likely for PostgreSQL databases. Given the context of monitoring, the best fit within the CNCF landscape is the 'Monitoring' category. Alternatives like Prometheus, Thanos, and VictoriaMetrics are well-known monitoring solutions in the CNCF ecosystem that could serve similar purposes, especially for database monitoring."},{"qubership-name":"qubership-envgene-instance","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided base64 content decodes to '# qubership-envgen-instance', which is insufficient to determine the category or subcategory within the CNCF landscape. More context or a detailed description of the component, application, or framework is needed to make an accurate classification and suggest alternatives."},{"qubership-name":"qubership-integration-designtime-catalog","category":"App Definition and Development","subcategory":"Integration & Delivery","alternatives":["Argo CD","Flux","Tekton"],"reasons":"The provided content describes a 'Design Time Catalog' as part of a global integration solution, which is managed via Docker Compose and interacts with a microservice handling design time configuration. This suggests it is related to application deployment, integration, and delivery within a cloud-native ecosystem. The CNCF landscape categorizes such solutions under 'App Definition and Development' with a subcategory of 'Integration & Delivery'. Alternatives like Argo CD, Flux, and Tekton are listed as they are prominent CNCF projects focused on continuous delivery and integration in cloud-native environments."},{"qubership-name":"qubership-apihub-api-doc-viewer","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Apollo GraphQL","GraphQL Voyager","Swagger UI","Redoc"],"reasons":"The provided file describes a library that renders JSON schemas, GraphQL schemas, and GraphAPI specifications in a human-readable way. This functionality is typically associated with API documentation and visualization tools, which fall under the 'App Definition and Development' category in the CNCF landscape. Specifically, it aligns with 'API Gateway' subcategory tools that help in visualizing and interacting with APIs. Alternatives like Apollo GraphQL, GraphQL Voyager, Swagger UI, and Redoc are well-known tools in this space that provide similar capabilities for visualizing and documenting APIs."},{"qubership-name":"pgskipper-backup-daemon","category":"Database","subcategory":"Backup and Recovery","alternatives":["Velero","Stash","KubeDB"],"reasons":"The provided file describes a solution named 'pgskipper-backup-daemon' which is focused on running periodic backups and recovering databases from these backups. This functionality aligns with the 'Backup and Recovery' subcategory under the 'Database' category in the CNCF landscape. Alternatives like Velero, Stash, and KubeDB are also focused on backup and recovery solutions for cloud-native environments, making them suitable alternatives."},{"qubership-name":"qubership-diag-proxy","category":"Observability and Analysis","subcategory":"Tracing","alternatives":["Jaeger","OpenTelemetry","Zipkin"],"reasons":"The provided file describes 'diag-proxy', a simple and tiny proxy based on Nginx that facilitates receiving diagnostic information from Profiler agents and tracing information from OTEL/Jaeger/Zipkin agents, then sending it to respective collectors in another namespace. This functionality aligns with the Observability and Analysis category, specifically under Tracing, as it deals with collecting and forwarding tracing data. The alternatives listed (Jaeger, OpenTelemetry, Zipkin) are well-known projects within the CNCF landscape that also handle tracing data, making them relevant comparisons."},{"qubership-name":"qubership-external-logging-installer","category":"Observability and Analysis","subcategory":"Logging","alternatives":["Fluent Bit","Loki","Elasticsearch + Filebeat"],"reasons":"FluentD is a data collector for unified logging layer, which is primarily used for aggregating and forwarding logs from containers and VMs. It fits under the 'Observability and Analysis' category in the CNCF landscape, specifically under the 'Logging' subcategory. Alternatives like Fluent Bit (a lighter-weight sibling of FluentD), Loki (a log aggregation system by Grafana Labs), and Elasticsearch + Filebeat (a popular logging stack) are also part of the CNCF ecosystem and serve similar purposes."},{"qubership-name":"qubership-core-context-propagation","category":"Application Definition and Development","subcategory":"Microservices","alternatives":["Spring Cloud Sleuth","OpenTelemetry","Jaeger"],"reasons":"The provided file describes a context propagation framework designed for microservices communication, which aligns with the 'Application Definition and Development' category in the CNCF landscape. Specifically, it fits under 'Microservices' as it facilitates the propagation of context (like headers, request IDs, etc.) between services. Alternatives like Spring Cloud Sleuth, OpenTelemetry, and Jaeger are listed as they also provide context propagation and tracing capabilities in microservices architectures."},{"qubership-name":"qubership-nifi-registry","category":"App Definition and Development","subcategory":"Database","alternatives":["Apache NiFi Registry","Harbor","Dragonfly"],"reasons":"The provided file describes 'qubership-nifi-registry', which is a fork of Apache NiFi Registry. Apache NiFi Registry is a service providing version control and export/import capabilities for Apache NiFi flows. Given its functionality, it falls under the 'App Definition and Development' category, specifically under the 'Database' subcategory as it involves data flow management and storage configuration (PostgreSQL). Alternatives like Apache NiFi Registry itself, Harbor (for artifact registry), and Dragonfly (for file distribution) are considered as they provide similar capabilities in the CNCF landscape."},{"qubership-name":"qubership-grafana-reporter","category":"Monitoring","subcategory":"Dashboards and Visualization","alternatives":["Grafana","Prometheus","Thanos","Cortex"],"reasons":"The solution described is a Grafana reporter, which is an HTTP server that generates Grafana dashboard reports and saves them in PDF format. It provides a REST API to fetch dashboard data and integrates with Grafana for visualization. This fits under the 'Monitoring' category in the CNCF landscape, specifically under 'Dashboards and Visualization', as it is closely related to Grafana, a well-known tool in this space. Alternatives include other monitoring and visualization tools like Prometheus, Thanos, and Cortex, which are also part of the CNCF landscape and serve similar purposes in monitoring and observability."},{"qubership-name":"qubership-nosqldb-operator-core","category":"App Definition and Development","subcategory":"Database","alternatives":["KubeDB","Percona Operator for MongoDB","Crunchy Data PostgreSQL Operator"],"reasons":"The provided file name 'qubership-nosqldb-operator-core' suggests that this is an operator for managing NoSQL databases in a Kubernetes environment. Operators fall under the 'App Definition and Development' category in the CNCF landscape, specifically within the 'Database' subcategory as it deals with database management. Alternatives like KubeDB, Percona Operator for MongoDB, and Crunchy Data PostgreSQL Operator are also operators designed to manage databases in Kubernetes, making them suitable alternatives."},{"qubership-name":"qubership-inventory-tool-cli","category":"App Definition and Development","subcategory":"Application Framework","alternatives":["Spring Boot","Quarkus","Micronaut"],"reasons":"The provided content describes a Java-based application framework (Vert.x) that is used for building and running applications. It includes details on building with Maven, running configurations, and various execution modes. Vert.x is a toolkit for building reactive applications on the JVM, which fits under the 'App Definition and Development' category in the CNCF landscape, specifically as an 'Application Framework'. Alternatives like Spring Boot, Quarkus, and Micronaut are also Java-based frameworks that serve similar purposes in the CNCF ecosystem."},{"qubership-name":"qubership-disaster-recovery-daemon","category":"Orchestration & Management","subcategory":"Disaster Recovery","alternatives":["Velero","Kasten","OpenEBS"],"reasons":"The 'Qubership Disaster Recovery Daemon' (DRD) is a service that facilitates communication between the Site Manager and the current cluster operator or disaster recovery controller. It provides features for disaster recovery, including managing the current mode in DR resources and implementing the Site Manager contract. This solution fits into the Disaster Recovery subcategory under Orchestration & Management in the CNCF landscape. Alternatives like Velero, Kasten, and OpenEBS are also focused on disaster recovery and backup solutions in cloud-native environments."},{"qubership-name":"qubership-prometheus-adapter-operator","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content describes a directory containing configuration and templates for generating HTML/Markdown documentation for an AMS operator's custom resource definitions (CRDs) using the 'gen-crd-api-reference-docs' project. However, it does not provide enough information to determine a specific CNCF category. The content is more about documentation generation for Kubernetes CRDs rather than a standalone CNCF project or tool. Therefore, it does not clearly fit into any CNCF category or subcategory, and no direct alternatives can be identified from the CNCF landscape based on the given information."},{"qubership-name":"qubership-core-microservice-framework-extensions","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Spring Cloud Gateway","Kong","Envoy","Traefik"],"reasons":"The provided file describes a framework extension for SpringDoc Swagger that adds additional functionality for securing requests through Swagger UI using m2m, user, or bearer authentication. This fits within the 'App Definition and Development' category as it pertains to API documentation and security, which are crucial for developing cloud-native applications. The 'API Gateway' subcategory is appropriate because the solution enhances API security and documentation, similar to other API gateway solutions in the CNCF landscape. Alternatives like Spring Cloud Gateway, Kong, Envoy, and Traefik are listed as they also provide API gateway functionalities with security features."},{"qubership-name":"qubership-kube-events-generator","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["Argo CD","Flux","Tekton"],"reasons":"The provided content describes a Kubernetes event generator, which is a tool for generating Kubernetes events. This fits into the 'App Definition and Development' category as it is related to application development and deployment within a Kubernetes environment. The subcategory 'Application Definition & Image Build' is chosen because the tool seems to be involved in generating events that could be part of the application lifecycle. Alternatives like Argo CD, Flux, and Tekton are listed as they are also tools within the CNCF landscape that deal with application deployment and lifecycle management in Kubernetes environments."},{"qubership-name":"pgskipper-dbaas-adapter","category":"Database","subcategory":"n/a","alternatives":["Vitess","TiDB","CockroachDB"],"reasons":"The component provides a REST API for logical database management, which aligns with the Database category in the CNCF landscape. It appears to be a database adapter or middleware, hence similar to other database solutions like Vitess, TiDB, and CockroachDB that also provide APIs or interfaces for database management. However, the description lacks specific details about the database type (SQL/NoSQL) or features, so the subcategory cannot be determined."},{"qubership-name":"qubership-api-linter-service","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Kong","Traefik","Envoy"],"reasons":"The description mentions that 'quebership-api-linter-service' is a Golang application (microservice) providing a REST API for linting OAS specification files. This suggests it is related to API management and linting, which falls under the 'App Definition and Development' category in the CNCF landscape. The subcategory 'API Gateway' is chosen because the service seems to handle API-related tasks, similar to other API gateways like Kong, Traefik, and Envoy. However, the project is noted as 'not production ready' and 'under development,' so the alternatives listed are more mature solutions in the same space."},{"qubership-name":"qubership-core-quarkus-extensions","category":"App Definition and Development","subcategory":"Streaming & Messaging","alternatives":["Apache Kafka","RabbitMQ","NATS","Eclipse Mosquitto"],"reasons":"The provided file describes an extension for the Quarkus framework that enables running a STOMP server over WebSocket or standard WebSocket protocol. STOMP (Simple Text Oriented Messaging Protocol) is a messaging protocol that is often used for message-oriented middleware. Given this functionality, the solution best fits under the 'Streaming & Messaging' subcategory of the 'App Definition and Development' category in the CNCF landscape. Alternatives like Apache Kafka, RabbitMQ, NATS, and Eclipse Mosquitto are also messaging solutions that support various protocols and can be used for similar purposes."},{"qubership-name":"qubership-core-lib-go-rest-utils","category":"Service Mesh","subcategory":"API Gateway","alternatives":["Istio","Linkerd","Envoy","Kong","Traefik"],"reasons":"The provided file describes a library for route registration in a control plane, which allows microservices to make REST calls without knowing the URL host. It supports different types of routes (internal, private, public, and facade gateways) and integrates with OpenShift. This functionality is typical of service mesh components, particularly API gateways, which manage traffic routing between services. The alternatives listed are other CNCF projects that provide similar routing and gateway functionalities."},{"qubership-name":"qubership-apihub-http-spec","category":"API Infrastructure","subcategory":"API Specifications","alternatives":["Swagger","JSON Schema","Apicurio"],"reasons":"The provided file describes a converter for OpenAPI schemas to JSON schemas, which is a tool used in API development and specification. This fits under the 'API Infrastructure' category in the CNCF landscape, specifically under 'API Specifications'. Alternatives like Swagger, JSON Schema, and Apicurio are also tools that deal with API specifications and schema management, making them relevant alternatives."},{"qubership-name":"qubership-core-lib-go-dbaas-cassandra-client","category":"Database","subcategory":"NewSQL","alternatives":["Cassandra","ScyllaDB","CockroachDB"],"reasons":"The provided file describes a Go client library for interacting with Cassandra databases, specifically designed to work with multi-tenancy and service databases. It provides functionality to create and manage connections to Cassandra, execute queries, and handle secure connections with TLS support. Given that Cassandra is a prominent NewSQL database in the CNCF landscape and the library is specifically tailored for Cassandra, it fits best under the 'Database' category with a 'NewSQL' subcategory. Alternatives like ScyllaDB (a Cassandra-compatible database) and CockroachDB (another NewSQL database) are also listed as they serve similar use cases."},{"qubership-name":"qubership-apihub-postman-collections","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Kong","Apigee","Tyk"],"reasons":"The provided content describes a setup for API testing and management, including creating test data, workspaces, packages, and dashboards. It also mentions API keys and internal user management, which are typical features of API gateways or API management tools. The CNCF landscape categorizes such tools under 'App Definition and Development' with a subcategory of 'API Gateway'. Alternatives like Kong, Apigee, and Tyk are well-known API gateways in the CNCF ecosystem that provide similar functionality."},{"qubership-name":"qubership-apihub-nodejs-dev-image","category":"n/a","subcategory":"n/a","alternatives":["n/a"],"reasons":"The provided content appears to be a list of installed software in a development environment, including Node.js, NPM, Yarn, Chrome, and Puppeteer. There is no clear description of a component, application, or framework that aligns with any specific category in the CNCF landscape. Therefore, it is not possible to determine a relevant CNCF category, subcategory, or alternatives based on the given information."},{"qubership-name":"qubership-mistral","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["Tekton","Argo","Cloud Native Buildpacks"],"reasons":"The provided content describes a process for creating custom actions within a Mistral environment, which involves setting up a Python library, defining actions, and building Docker images. This aligns with the 'App Definition and Development' category in the CNCF landscape, specifically under 'Application Definition & Image Build'. Alternatives like Tekton, Argo, and Cloud Native Buildpacks are suitable as they also focus on defining and building applications in a cloud-native environment. The content does not provide enough information to determine if it fits into more specific subcategories like 'Continuous Integration & Delivery'."},{"qubership-name":"qubership-envgene","category":"App Definition and Development","subcategory":"Environment Management","alternatives":["Helm","Kustomize","Jsonnet","Tanka"],"reasons":"The provided file describes a tool named 'EnvGene' (Environment Generator) that manages environment configurations, templates, and credentials. It focuses on defining and generating environments using YAML configurations, which aligns with the 'App Definition and Development' category in the CNCF landscape. Specifically, it falls under 'Environment Management' as it deals with environment-specific configurations and templates. Alternatives like Helm, Kustomize, Jsonnet, and Tanka are also used for managing environment configurations and deployments in cloud-native ecosystems."},{"qubership-name":"base-images-module-base","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided base64 content 'IyBiYXNlLWltYWdlcy1tb2R1bGUtYmFzZQ==' decodes to '# base-images-module-base', which is insufficient to determine the category or subcategory within the CNCF landscape. The content appears to be a comment or a fragment, possibly related to container images or modules, but without additional context, it's impossible to classify it accurately or suggest alternatives."},{"qubership-name":"qubership-opentelemetry-helm-charts","category":"Observability and Analysis","subcategory":"Monitoring","alternatives":["Prometheus","Jaeger","Fluentd","Grafana"],"reasons":"The provided file describes a collection of common configurations for the OpenTelemetry Operator, which is a part of the OpenTelemetry project. OpenTelemetry is a set of APIs, libraries, agents, and instrumentation to facilitate observability in cloud-native environments. It falls under the 'Observability and Analysis' category in the CNCF landscape, specifically under 'Monitoring'. Alternatives like Prometheus, Jaeger, Fluentd, and Grafana are also part of the CNCF landscape and serve similar purposes in monitoring and observability."},{"qubership-name":"qubership-consul","category":"n/a","subcategory":"n/a","alternatives":["n/a"],"reasons":"The provided content is insufficient to determine the category or subcategory within the CNCF landscape. The description mentions the usage of integration tests based on the Robot Framework, but it does not provide enough context about the solution's purpose, architecture, or functionality to classify it under a specific CNCF category or to suggest alternatives."},{"qubership-name":"pgskipper-pgbackrest-sidecar","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content is insufficient to determine the category or subcategory within the CNCF landscape. The text appears to be a filename or a partial description ('pgskipper-pgbackrest-sidecar'), but without additional context or details about the functionality, purpose, or architecture of the solution, it is not possible to accurately classify it or suggest alternatives. More information is needed to make a proper assessment."},{"qubership-name":"qubership-core-blue-green-state-monitor","category":"App Definition and Development","subcategory":"Configuration Management","alternatives":["Spring Cloud Config","Kubernetes ConfigMap","HashiCorp Consul"],"reasons":"The provided file describes a Spring Boot library for configuration management with BlueGreenStatePublisher, which is used for managing application state and configuration. This fits well under the 'Configuration Management' subcategory of 'App Definition and Development' in the CNCF landscape. Alternatives like Spring Cloud Config, Kubernetes ConfigMap, and HashiCorp Consul are also used for similar purposes in cloud-native environments."},{"qubership-name":"qubership-maas-declarative-client-commons","category":"App Definition and Development","subcategory":"Streaming & Messaging","alternatives":["Apache Kafka","RabbitMQ","NATS","Pulsar"],"reasons":"The provided content describes a module that facilitates the creation of Kafka consumers and producers declaratively, which falls under the messaging and streaming category. The CNCF landscape includes several projects in this space, with Apache Kafka being the most directly related. Alternatives like RabbitMQ, NATS, and Pulsar are also part of the CNCF landscape and serve similar purposes in messaging and event streaming."},{"qubership-name":"qubership-apihub-json-crawl","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["json-patch","jsonpath","jq"],"reasons":"The provided file describes a utility package for crawling/cloning JSON objects in a tree-like structure. This functionality is primarily related to JSON manipulation and traversal, which falls under the 'App Definition and Development' category in the CNCF landscape. Specifically, it fits into the 'Application Definition & Image Build' subcategory as it deals with data manipulation and transformation, which are common tasks during application development. Alternatives like 'json-patch', 'jsonpath', and 'jq' are also tools that handle JSON data manipulation and are listed in the CNCF landscape under similar categories."},{"qubership-name":"qubership-cql-driver","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided base64 content 'IyBxdWJlcnNoaXAtY3FsLWRyaXZlcg==' decodes to '# qubership-cql-driver', which is insufficient to determine the category or subcategory within the CNCF landscape. Without additional context or description of the component, application, or framework, it is not possible to accurately classify it or suggest alternatives."},{"qubership-name":"gatekeeper-library","category":"App Definition and Development","subcategory":"Documentation","alternatives":["VuePress","MkDocs","GitBook"],"reasons":"The provided content describes a static website generator (Docusaurus 2) used for building and deploying documentation websites. This fits well under the 'Documentation' subcategory within 'App Definition and Development' in the CNCF landscape. Alternatives like VuePress, MkDocs, and GitBook are also static site generators commonly used for documentation purposes in the CNCF ecosystem."},{"qubership-name":"qubership-core-lib-go-maas-segmentio","category":"Messaging and Eventing","subcategory":"Publish & Subscribe","alternatives":["Apache Kafka","NATS","RabbitMQ","Pulsar"],"reasons":"The provided file describes a library that facilitates interaction with Kafka by providing methods to provision Kafka structures based on topic information received from Maas. It includes functionality for creating Kafka writers and readers, which are fundamental components in publish-subscribe messaging systems. Given its focus on Kafka integration and message handling, it best fits under the 'Messaging and Eventing' category with a subcategory of 'Publish & Subscribe'. Alternatives like Apache Kafka, NATS, RabbitMQ, and Pulsar are also part of the CNCF landscape and serve similar purposes in message brokering and event streaming."},{"qubership-name":"qubership-docker-opensearch","category":"Security and Compliance","subcategory":"Policy Management","alternatives":["OPA (Open Policy Agent)","Kyverno","Falco"],"reasons":"The provided file describes a security filtering plugin for OpenSearch that manages access control and policy enforcement for Index State Management (ISM) operations. This functionality aligns with the 'Security and Compliance' category in the CNCF landscape, specifically under 'Policy Management'. The plugin enforces policies based on user roles and resource prefixes, which is similar to what solutions like OPA (Open Policy Agent), Kyverno, and Falco offer in the CNCF ecosystem. These tools also provide policy enforcement and security filtering capabilities, making them suitable alternatives."},{"qubership-name":"qubership-graylog-plugins-init","category":"Observability and Analysis","subcategory":"Logging","alternatives":["Fluentd","Fluent Bit","Logstash"],"reasons":"The provided file describes an init container for customizing Graylog with predefined plugins. Graylog is a centralized logging solution that falls under the 'Observability and Analysis' category in the CNCF landscape, specifically under the 'Logging' subcategory. The alternatives listed (Fluentd, Fluent Bit, Logstash) are also popular logging solutions within the CNCF ecosystem that provide similar functionality for log aggregation and processing."},{"qubership-name":"qubership-apihub","category":"App Definition and Development","subcategory":"Helm Charts","alternatives":["Kustomize","Helm","Operator Framework"],"reasons":"The provided file describes a Helm chart for deploying Quubership APIHUB to a Kubernetes cluster. Helm is a package manager for Kubernetes, which falls under the 'App Definition and Development' category in the CNCF landscape. The subcategory is 'Helm Charts' as the content specifically mentions Helm. Alternatives include Kustomize, Helm itself (as it is the primary tool for this use case), and Operator Framework for more complex application management scenarios. The reasons for this categorization are based on the explicit mention of Helm and Kubernetes deployment, which aligns with the tools and projects listed under 'App Definition and Development' in the CNCF landscape."},{"qubership-name":"qubership-zookeeper-backup-daemon","category":"n/a","subcategory":"n/a","alternatives":["n/a"],"reasons":"The provided content describes a performance test involving ZooKeeper Backup Daemon and its impact on ZooKeeper performance. However, it does not provide enough information to determine the specific category or subcategory within the CNCF landscape. The content focuses on a performance test scenario rather than describing a full-fledged component, application, or framework. Therefore, it is not possible to accurately classify it or suggest alternatives from the CNCF landscape based on the given information."},{"qubership-name":"qubership-apihub-sniffer-agent","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content describes a folder containing public data types and constants for interacting with external systems and users, along with some Go files representing operation results and requests. However, this information is too generic and lacks specific details about the functionality, purpose, or architecture of the solution. Without more context, it is not possible to accurately determine its category within the CNCF landscape. The CNCF landscape includes categories like 'Application Definition & Development', 'Orchestration & Management', 'Runtime', 'Provisioning', and others, but the given description does not align clearly with any of them. Additionally, no similar alternatives can be suggested without a clearer understanding of the solution's role or features."},{"qubership-name":"cla-storage","category":"n/a","subcategory":"n/a","alternatives":[],"reasons":"The provided content is a base64 encoded string 'IyBjbGEtc3RvcmFnZQ==', which decodes to '# cla-storage'. This is insufficient to determine the category or subcategory within the CNCF landscape. Additionally, no meaningful description or context is provided to identify similar solutions (alternatives) from the CNCF landscape."},{"qubership-name":"qubership-maas-client","category":"Messaging and Streaming","subcategory":"Message Queue","alternatives":["RabbitMQ","Apache Kafka","NATS","Apache Pulsar"],"reasons":"The provided file describes a module for working with RabbitMQ in a dynamic queue context, which is a message queue system. RabbitMQ is a well-known message broker that fits into the 'Messaging and Streaming' category of the CNCF landscape. The dynamic queue creation and binding described in the file are typical features of message queue systems. Alternatives like Apache Kafka, NATS, and Apache Pulsar are also part of the CNCF landscape and serve similar purposes, though they differ in their design and use cases (e.g., Kafka is more focused on streaming and log aggregation, while NATS is lightweight and designed for high performance)."},{"qubership-name":"qubership-core-microservice-framework","category":"App Definition and Development","subcategory":"Microservices Framework","alternatives":["Spring Cloud","Micronaut","Quarkus"],"reasons":"The provided file describes a microservice framework intended for use with WebClient in a blocking mode, which aligns with the 'App Definition and Development' category in the CNCF landscape. The framework includes features for enabling microservice functionality, initializing Spring context, and integrating with databases like MongoDB and PostgreSQL. Alternatives like Spring Cloud, Micronaut, and Quarkus are listed as they are well-known frameworks in the CNCF ecosystem that provide similar microservices capabilities, including REST client functionality, database integration, and Spring compatibility."},{"qubership-name":"qubership-pipelines-modules-ops","category":"App Definition and Development","subcategory":"Application Definition & Image Build","alternatives":["Tekton","Argo Workflows","Jenkins X"],"reasons":"The name 'qubership-pipelines-modules-ops' suggests that this is a solution related to pipelines and operations, likely in the context of CI/CD or workflow automation. Given the mention of 'pipelines' and 'modules', it seems to be a tool for defining and managing application deployment workflows. The CNCF category 'App Definition and Development' with the subcategory 'Application Definition & Image Build' fits well, as it includes tools for building, testing, and deploying applications. Alternatives like Tekton, Argo Workflows, and Jenkins X are also pipeline-focused tools within the CNCF landscape."},{"qubership-name":"qubership-graphite-remote-adapter","category":"App Definition and Development","subcategory":"Web Framework","alternatives":["React","Vue.js","Angular","Svelte"],"reasons":"The description mentions a UI package containing static files and templates for web UI, which is compiled into a binary using go-bindata. This suggests it's a tool for building web interfaces, likely part of a larger application framework. The mention of npm and gulp for managing frontend dependencies further indicates it's related to web development. The CNCF landscape doesn't have a direct match for this specific tool, but it fits best under 'App Definition and Development' as a web framework. Alternatives are popular frontend frameworks that also handle static assets and templating."},{"qubership-name":"qubership-core-ingress-gateway","category":"Networking","subcategory":"API Gateway","alternatives":["Kong","Traefik","Contour","Gloo"],"reasons":"The provided file describes an Ingress Gateway based on Envoy proxy, which is a common component in cloud-native environments for managing inbound traffic to services. The description mentions dynamic configuration loading from a control plane, support for multiple gateways (public, private, internal, egress), and graceful shutdown features. These characteristics align with the API Gateway subcategory under Networking in the CNCF landscape. Alternatives like Kong, Traefik, Contour, and Gloo are also API gateways that provide similar functionality and are part of the CNCF ecosystem."},{"qubership-name":"k8s-conformance","category":"Orchestration & Management","subcategory":"Kubernetes Platforms","alternatives":["OpenShift","Rancher","EKS (Amazon Elastic Kubernetes Service)","GKE (Google Kubernetes Engine)","AKS (Azure Kubernetes Service)"],"reasons":"The provided content describes a cloud-native platform based on Kubernetes, which is used for orchestrating containerized applications. The commands and processes mentioned (e.g., joining nodes, running conformance tests) are typical for Kubernetes-based platforms. This fits well under the 'Orchestration & Management' category in the CNCF landscape, specifically under 'Kubernetes Platforms'. Alternatives like OpenShift, Rancher, and managed Kubernetes services (EKS, GKE, AKS) are similar solutions that also provide Kubernetes-based orchestration and management."},{"qubership-name":"robot-shop","category":"App Definition and Development","subcategory":"Application Testing","alternatives":["Locust","k6","Gatling"],"reasons":"The provided file describes a load generation tool for testing applications, which can be run directly via Docker or within a Kubernetes cluster. This fits under the 'Application Testing' subcategory of 'App Definition and Development' in the CNCF landscape. Alternatives like Locust, k6, and Gatling are also load testing tools that are part of the CNCF ecosystem and serve similar purposes."},{"qubership-name":"qubership-core-blue-green-state-monitor-quarkus","category":"App Definition and Development","subcategory":"Microservice Tools","alternatives":["Spring Cloud","Micronaut","Quarkus"],"reasons":"The provided file describes a library that integrates with Quarkus to provide Blue-Green state monitoring and Microservice Mutex Service functionality. This fits into the 'App Definition and Development' category under 'Microservice Tools' as it provides tools and libraries for developing microservices. Alternatives like Spring Cloud, Micronaut, and Quarkus are also part of the CNCF landscape and provide similar capabilities for microservice development and management."},{"qubership-name":"qubership-cloud-passport-cli","category":"App Definition and Development","subcategory":"Client SDK","alternatives":["kubernetes-client/python","client-go","kubebuilder"],"reasons":"The provided file describes an open-source Python library used by KuberShip Cloud Passport module, which appears to be a client library for interacting with KuberShip Cloud services. This fits best under the 'Client SDK' subcategory of 'App Definition and Development' in the CNCF landscape. Alternatives include other client libraries like kubernetes-client/python (official Kubernetes Python client), client-go (official Kubernetes Go client), and kubebuilder (SDK for building Kubernetes APIs). The exact nature of KuberShip Cloud isn't fully clear from the description, but given the mention of a Python client library, these are reasonable alternatives."},{"qubership-name":"qubership-landscape-config-processor","category":"App Definition and Development","subcategory":"Configuration","alternatives":["kustomize","helm","jsonnet"],"reasons":"The provided file describes a tool called 'landscape-config-processor' which is used to manage and merge YAML configuration files for the CNCF Landscape application. This tool falls under the 'App Definition and Development' category as it deals with configuration management for applications. The 'Configuration' subcategory is appropriate because the tool specifically handles YAML configuration files, similar to other CNCF tools like kustomize, helm, and jsonnet, which are used for managing and templating configuration files in cloud-native environments. The tool's functionality is focused on merging and customizing configuration files, which aligns well with the purpose of these alternatives."},{"qubership-name":"qubership-docker-integration-tests","category":"Testing","subcategory":"n/a","alternatives":["Testkube","Sonobuoy"],"reasons":"The provided description mentions a Robot Framework library for writing RF integration tests for Kubernetes-based applications. This aligns with the 'Testing' category in the CNCF landscape. Testkube and Sonobuoy are similar solutions in the CNCF landscape that focus on testing Kubernetes applications. The subcategory could not be determined from the provided information."},{"qubership-name":"qubership-apihub-jest-chrome-in-docker-environment","category":"Testing","subcategory":"Browser Testing","alternatives":["Selenium","Cypress","TestCafe","Playwright"],"reasons":"The provided file describes a tool called 'qubership-apihub-jest-chrome-in-docker-environment' which is designed to run Chrome browser in identical environments across different machines, including CI and local PCs. The main goal is to run screenshot tests that are insensitive to OS, browser version, etc. This aligns with the 'Testing' category in the CNCF landscape, specifically under 'Browser Testing' subcategory. Alternatives like Selenium, Cypress, TestCafe, and Playwright are also tools that facilitate browser testing in cloud-native environments."},{"qubership-name":"qubership-apihub-ui-tests","category":"App Definition and Development","subcategory":"Testing","alternatives":["Selenium","Cypress","TestCafe"],"reasons":"The provided file describes a project used for creating and running auto-tests, primarily for UI E2E (End-to-End) testing, using the Playwright framework. This fits well within the 'Testing' subcategory of 'App Definition and Development' in the CNCF landscape. Alternatives like Selenium, Cypress, and TestCafe are also popular tools in the CNCF ecosystem for UI testing and automation."},{"qubership-name":"qubership-apihub-test-service","category":"App Definition and Development","subcategory":"API Gateway","alternatives":["Kong","Traefik","Envoy"],"reasons":"The provided description mentions a microservice that exposes various API specifications (REST, GraphQL, Async, etc.) and is used as a utility for testing needs in the context of Quibership-APIHUB. This aligns with the functionality of an API Gateway, which manages and routes API requests. Alternatives like Kong, Traefik, and Envoy are listed as they are prominent API Gateway solutions within the CNCF landscape. The description does not provide enough detail to determine if it fits into a more specific subcategory or if there are other alternatives that might be more suitable."}]}